[
{
    "people_id": "1",
    "people_name": "Αντώνης Αργυρός",
    "people_name_en": "Antonis Argyros",
    "people_email": "argyros@csd.uoc.gr",
    "people_ext_url": "http:\/\/www.csd.uoc.gr\/~argyros",
    "people_text": "Πήρε το Διδακτορικό του το 1996 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Έχει διατελέσει ως μεταδιδακτορικός ερευνητής στο Royal Institute of Technology (KTH) στη Στοκχόλμη της Σουηδίας. Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν την υπολογιστική όραση και την αναγνώριση προτύπων με έμφαση στην 3Δ ανακατασκευή, στην παρακολούθηση και αντίληψη κίνησης, στην ανάλυση της γεωμετρίας και κίνησης του ανθρώπινου σώματος και στην αναγνώριση των ανθρώπινων δραστηριοτήτων και χειρονομιών με βάση οπτική πληροφορία. Ενδιαφέρεται επίσης για εφαρμογές της υπολογιστικής όρασης στη ρομποτική και στην αλληλεπίδραση ανθρώπου-υπολογιστή.",
    "people_text_en": "He received his PhD in 1996 from the Computer Science Department, University of Crete. He has been a postdoctoral research at the Royal Institute of Technology (KTH), in Stockholm, Sweden. His research interests include the areas of computer vision and pattern recognition with emphasis on 3D reconstruction, motion perception and tracking, analysis of the geometry and motion of the human body as well as human action and gesture recognition based on visual information.&nbsp; He is also interested in applications of computer vision in the fields of robotics and smart environments.",
    "people_img_src": "argyros.jpg",
    "position_id": "1"
},
{
    "people_id": "2",
    "people_name": "Μανόλης Κατεβαίνης",
    "people_name_en": "Manolis G.H. Katevenis",
    "people_email": "kateveni@csd.uoc.gr",
    "people_ext_url": "http:\/\/users.ics.forth.gr\/~kateveni\/",
    "people_text": "Πήρε το Διδακτορικό του το 1983 από το Πανεπιστήμιο της Καλιφόρνια στο Berkeley στις Η.Π.Α. ΄Ηταν επίκουρος καθηγητής στο Πανεπιστήμιο Stanford στις Η.Π.Α. Τα ενδιαφέροντα του περιλαμβάνουν Αρχιτεκτονική Μεταγωγέων Πακέτων, Αρχιτεκτονική Δικτύων Υψηλών Ταχυτήτων, Αρχιτεκτονική Υπολογιστών, Συστήματα VLSI.",
    "people_text_en": "He received his PhD in 1983 from the University of California, Berkeley, USA. His research interests include Embedded and Scalable Multiprocessor System Architecture, Interprocessor Communication Mechanisms, Interconnection Network Architecture, Packet Switch Architecture, Computer Architecture, VLSI Systems.",
    "people_img_src": "15555825888152015_12_22.MGHKatevenis_lecturing_sm.jpg",
    "position_id": "1"
},
{
    "people_id": "3",
    "people_name": "Ευάγγελος Μαρκάτος",
    "people_name_en": "Evangelos Markatos",
    "people_email": "markatos@csd.uoc.gr",
    "people_ext_url": " http:\/\/users.ics.forth.gr\/~markatos\/ ",
    "people_text": "Πήρε το Διδακτορικό του το 1993 από το Πανεπιστήμιο του Rochester στις Η.Π.Α. Τα ενδιαφέροντα του περιλαμβάνουν Συστήματα και Τεχνολογίες για το Διαδίκτυο, Παγκόσμιος Ιστός, Συστήματα τύπου GRID, Ομότιμα Δίκτυα και Εφαρμογές, Παράλληλα και Κατανεμημένα Συστήματα, Λειτουργικά Συστήματα, Αρχιτεκτονική Υπολογιστών.",
    "people_text_en": "He received his PhD in 1993 from the University of Rochester, NY, USA. His research interests are in the broader area of Systems (Internet Systems and Monitoring, Systems and Network Security, World Wide Web, Internet Systems and Technologies , Operating Systems).",
    "people_img_src": "eyaggelosmarkatos.jpg",
    "position_id": "1"
},
{
    "people_id": "4",
    "people_name": "Άγγελος Μπίλας",
    "people_name_en": "Angelos Bilas",
    "people_email": "bilas@csd.uoc.gr",
    "people_ext_url": "http:\/\/www.ics.forth.gr\/~bilas\/",
    "people_text": "Πήρε το Διδακτορικό του το 1998 από το Πανεπιστήμιο Princeton, Η.Π.Α. Εργάστηκε ως Επίκουρος Καθηγητής στο Πανεπιστήμιο του Τορόντο (1998-2002). Τα ενδιαφέροντά του περιλαμβάνουν γενικά τα Συστήματα Υπολογιστών, το Λογισμικό Συστημάτων και την Αρχιτεκτονική Υπολογιστών, με έμφαση τα τελευταία χρόνια σε Συστήματα Αποθήκευσης Δεδομένων (Storage Systems) και Εξυπηρετητές Κέντρων Δεδομένων (Datacenter Servers).<br \/>\r\n&nbsp;",
    "people_text_en": "He received his Ph.D. in 1998 from Princeton University, USA. He held an Assistant Professor position in the Electrical and Computer Engineering Department in University of Toronto (1998-2002). His interests include the general area of computer systems, systems software, and computer architecture, lately with emphasis on storage systems and datacenter servers.<br \/>\r\n&nbsp;",
    "people_img_src": "bilasphoto.jpg",
    "position_id": "1"
},
{
    "people_id": "6",
    "people_name": "Δημήτρης Πλεξουσάκης",
    "people_name_en": "Dimitris Plexousakis",
    "people_email": "dp@csd.uoc.gr",
    "people_ext_url": "index.jsp?custom=dimitris_pleksousakis",
    "people_text": "Πήρε το Διδακτορικό του το 1996 από το Πανεπιστήμιο του Τορόντο. Τα ενδιαφέροντα του περιλαμβάνουν Ενεργούς και παραγωγικές Βάσεις Δεδομένων, Σσυστήματα Διαχείρισης Βάσεων Γνώσεων, Παράσταση Γνώσεων, Προσομοίωση και Ανάλυση Επιχειρησιακών Διεργασιών με Λογικό Προγραμματισμό.",
    "people_text_en": "He received his PhD in 1996 from the University of Toronto, Canada. His research interests are in the broader area of Data and Knowledge Management.",
    "people_img_src": "dimitrispleksoysakis.jpg",
    "position_id": "1"
},
{
    "people_id": "7",
    "people_name": "Κωνσταντίνος Στεφανίδης",
    "people_name_en": "Constantine Stephanidis",
    "people_email": "cs@csd.uoc.gr",
    "people_ext_url": "index.jsp?custom=constantine_stephanidis",
    "people_text": "Πήρε το διδακτορικό του το 1987 από το Πανεπιστήμιο του Kent at Canterbury. Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν το Σχεδιασμό και την Ανάπτυξη Μεθοδολογιών και Εργαλείων για τη σχεδίαση, ανάπτυξη και αξιολόγηση διεπαφών, με ιδιαίτερη έμφαση στην Καθολική Σχεδίαση και την Καθολική Πρόσβαση.",
    "people_text_en": "He received his PhD in 1987 from the University of Kent at Canterbury, UK. His research interests are in the broader area of Human - Computer Interaction (Design for All, New methodologies, techniques and tools for the design, development and evaluation of applications and services that exhibit automatic adaptation, personalization and intelligent interface behavior, Ambient Intelligence environments).",
    "people_img_src": "konstantinosstefanidis.jpg",
    "position_id": "1"
},
{
    "people_id": "8",
    "people_name": "Αντώνιος Σαββίδης",
    "people_name_en": "Antonios Savides",
    "people_email": "savidis@csd.uoc.gr",
    "people_ext_url": "https:\/\/www.ics.forth.gr\/person\/Savidis\/%CE%91%CE%BD%CF%84%CF%8E%CE%BD%CE%B9%CE%BF%CF%82?lang=el",
    "people_text": "Πήρε το διδακτορικό του το 1999 από το Πανεπιστήμιο του Kent της Αγγλίας. Τα ερευνητικά του ενδιαφέροντα εστιάζονται σε: Ανάπτυξη Δηλωτικών και Δυναμικών Γλωσσών Προγραμματισμού, Κατασκευή Εκσφαλματωτών Πηγαίου Κώδικα, Αμυντικό και Ακραίο Προγραμματισμό, Τεχνολογία Λογισμικού, Προγραμματιστικές Βιβλιοθήκες Δημιουργίας Περιβαλλόντων Διάχυτης Ευφυΐας, Μηχανές Λογισμικού και Εργαλεία Ανάπτυξης Προηγμένων Δισδιάστατων Παιχνιδιών.",
    "people_text_en": "He received his PhD from the University of Kent at Canterbury, UK. His research interests are in the broader area of Programming Languages, Software Engineering and Applications.",
    "people_img_src": "antoniossavidis.jpg",
    "position_id": "1"
},
{
    "people_id": "9",
    "people_name": "Ιωάννης Στυλιανού",
    "people_name_en": "Yannis Stylianou",
    "people_email": "yannis@csd.uoc.gr",
    "people_ext_url": "index.jsp?custom=yannis_stylianou",
    "people_text": "Πήρε το Διδακτορικό του το 1996 από την Ανώτατη Σχολή Τηλεπικοινωνιών της Γαλλίας (Ecole Nationale Superieure de Telecommunications, ΕNST-Telecom, Paris). Ηταν ερευνητής στα εργαστήρια της AT&amp;T (AT&amp;T Labs, Bell-Labs) στο Murray Hill, NJ στις Η.Π.Α. Τα ενδιαφέροντα του περιλαμβάνουν Ψηφιακή Επεξεργασία Σήματος, Ανάλυση Χρονοσειρών και Αναγνώριση Προτύπων, Ψηφιακή Επεξεργασία Βίντεο,&nbsp; Επεξεργασία στατιστικών σημάτων, Επεξεργασία βιοϊατρικών σημάτων και βιοακουστική. Κύρια εφαρμογή σε διαλογικά συστήματα τεχνητής νοημοσύνης.&nbsp;&nbsp;",
    "people_text_en": "He received his PhD in 1996 from ENST-Telecom, Paris, France. His research interests are in the broader area of &nbsp;Signals and Systems Processing (Speech Signal Processing, Audio Signal Processing, Statistical Signal Processing, Biomedical Signal Processing and Bioacoustics).",
    "people_img_src": "yannisstylianou.jpg",
    "position_id": "1"
},
{
    "people_id": "10",
    "people_name": "Γιώργος Τζιρίτας",
    "people_name_en": "George Tziritas",
    "people_email": "tziritas@csd.uoc.gr",
    "people_ext_url": "http:\/\/www.csd.uoc.gr\/~tziritas\/",
    "people_text": "Πήρε το Διδακτορικό του το 1981 από το Πολυτεχνικό Ινστιτούτο της Grenoble στη Γαλλία. ΄Ηταν ερευνητής στο&nbsp;&nbsp; Εθνικό Κέντρο Επιστημονικής Έρευνας (C.N.R.S.) της Γαλλίας. Τα ενδιαφέροντα του περιλαμβάνουν Ψηφιακή Eπεξεργασία Εικόνων και Σημάτων, Αναγνώριση Προτύπων και Ανάλυση Εικόνων, Μηχανική Μάθηση και Συστήματα Πολυμέσων.",
    "people_text_en": "He received his PhD in 1981 from the Institute of National Polytechnique, Grenoble, France. His research interests include Digital Image Processing, Digital Video Processing, Computer Vision, Pattern Recognition, Image and Video Communication, Machine Learning, Multimedia Systems.",
    "people_img_src": "georgetziritas.jpg",
    "position_id": "1"
},
{
    "people_id": "11",
    "people_name": "Απόστολος Τραγανίτης",
    "people_name_en": "Apostolos Traganitis",
    "people_email": "tragani@csd.uoc.gr",
    "people_ext_url": "index.jsp?custom=apostolos_traganitis",
    "people_text": "Πήρε το Διδακτορικό του το 1975 από το Πανεπιστήμιο Princeton στις ΗΠΑ. Εργάστηκε στο Ερευνητικό Κέντρο του Ελλ. Πολ. Ναυτικού, στο Ε. Μ. Πολυτεχνείο και ήταν επίκουρος καθηγητής στο Αριστ. Πανεπ. Θεσσαλονίκης. Τα ενδιαφέροντα του περιλαμβάνουν Ψηφιακές Επικοινωνίες, Δίκτυα Υπολογιστών και Ψηφιακά Συστήματα.",
    "people_text_en": "He received his PhD in 1975 from Princeton University, USA. His research interests are in the broader areas of Communication Systems, Digital and Analog electronics.",
    "people_img_src": "apostolostraganitis.gif",
    "position_id": "1"
},
{
    "people_id": "12",
    "people_name": "Ιωάννης Τόλλης",
    "people_name_en": "Ioannis Tollis",
    "people_email": "tollis@csd.uoc.gr",
    "people_ext_url": "http:\/\/www.csd.uoc.gr\/CSD\/index.jsp?custom=ioannis_tollis",
    "people_text": "Πήρε το Διδακτορικό του τον Ιαν. 1988 από το Πανεπιστήμιο του Illinois at Urbana-Champaign, Η.Π.Α. Πριν το Π.Κ. ήταν καθηγητής στο Πανεπιστήμιο του Τέξας από τον Δεκ. 1987&nbsp; εως το 2004.<br \/>\r\nΕχει διατελέσει επισκέπτης καθηγητής σε διαφορα Πανεπιστήμια (σαν το Brown Univ., Univ. of Rome, Univ. of Perugia, κ.α.) Τα ενδιαφέροντα του περιλαμβάνουν Οπτικοποίηση Γράφων, Έυρεση-Σχεδίαση-Ανάλυση-Οπτικοποίηση Δικτύων, Ανάλυση Πληροφορίας\/Δεδομενων, Βιοιατρική Πληροφορική, Αλγόριθμους Γράφων, Αλγόριθμους και Εφαρμογές",
    "people_text_en": "He received his Ph.D. degree in Computer Science from the University of Illinois at Urbana-Champaign in Jan. 1988. Before coming to UOC he was Professor of Computer Science The University of Texas at Dallas, Dec. 1987-2004.<br \/>\r\nHe has been a visiting professor in several universities including:&nbsp; Brown Univ., Univ. of Rome, Univ. of Perugia.<br \/>\r\nHis research interests are in Graph Drawing, Discovery, Design, Analysis, and Visualization of Networks, Information Visualization and Data Analytics, Biomedical Informatics, and Algorithms and Applications.",
    "people_img_src": "ioannistollis.jpg",
    "position_id": "1"
},
{
    "people_id": "13",
    "people_name": "Πάνος Τραχανιάς",
    "people_name_en": "Panos Trahanias",
    "people_email": "trahania@csd.uoc.gr",
    "people_ext_url": "http:\/\/users.ics.forth.gr\/~trahania\/home.html",
    "people_text": "Πήρε το Διδακτορικό του το 1988 από το Εθνικό Μετσόβιο Πολυτεχνείο. Ήταν ερευνητής στο Πανεπιστήμιο του Toronto στον Καναδά. Τα ενδιαφέροντα του περιλαμβάνουν Ευφυή Ρομποτικά Συστήματα, Αλληλεπίδραση Ανθρώπου-Ρομπότ, Αυτόνομη Ρομποτική Πλοήγηση, Γνωσιακή Ρομποτική και Διαδικασίες Μάθησης, Αναγνώριση Προτύπων, Υπολογιστική Όραση.",
    "people_text_en": "He received his PhD in 1988 from the National Technical University of Athens, Greece. His research interests are in the broader areas of Computational Vision (Articulated object tracking, Gesture recognition) and Autonomous Robots (Autonomous Robot Navigation, Human-Robot Interaction, Biologically-inspired Robot-control Architectures).",
    "people_img_src": "panagiotistrahanias.jpg",
    "position_id": "1"
},
{
    "people_id": "14",
    "people_name": "Παναγιώτης Τσακαλίδης",
    "people_name_en": "Panagiotis Tsakalides",
    "people_email": "tsakalid@csd.uoc.gr",
    "people_ext_url": "http:\/\/users.ics.forth.gr\/~tsakalid\/",
    "people_text": "Πήρε το Διδακτορικό του το 1995 από το University of Southern California (USC) στις Η.Π.Α. Εργάστηκε ως επισκέπτης επίκουρος καθηγητής στο USC και στο Πανεπιστήμιο Πατρών, καθώς και ως σύμβουλος στην εταιρία MultiSpec στο Huntington Beach της Καλιφόρνια. Τα ενδιαφέροντα του περιλαμβάνουν Τηλεπικοινωνιακά Συστήματα, Στατιστική Επεξεργασία Σημάτων, Συστήματα Πολυμέσων, και Ανάλυση μη-Γκαουσιανών Χρονοσειρών, Αραιές αναπαραστάσεις, τεχνικές ελάττωσης διάστασης και αρχιτεκτονικές βαθιάς μάθησης για την ανάπτυξη μεθόδων μη-εποπτευόμενης μάθησης, κωδικοποίησης και ανάλυσης δεδομένων σε εφαρμογές αστροφυσικής, παρατήρησης γης και βιολογίας",
    "people_text_en": "He received his PhD in 1995 from the University of Southern California, USA. His research interests are in the broader areas of Digital Signal Processing, Information Theory\/Mutimedia Signal Processing, and Telecommunication Systems.",
    "people_img_src": "panagiotistsakalidis.jpg",
    "position_id": "1"
},
{
    "people_id": "16",
    "people_name": "Ιωάννης Τσαμαρδίνος",
    "people_name_en": "Ioannis Tsamardinos",
    "people_email": "tsamard@csd.uoc.gr",
    "people_ext_url": "http:\/\/www.mensxmachina.org",
    "people_text": "Πήρε το διδακτορικό του το 2001 από το Πανεπιστήμιο Pittsburgh, στις Η.Π.Α και εργάστηκε ως επίκουρος καθηγητής μέχρι το 2006 στο τμήμα Βιοϊατρικής Πληροφορικής του Πανεπιστημίου Vanderbilt. Τα ενδιαφέροντα του επικεντρώνονται στην Βιοϊατρική Πληροφορική, μηχανική μάθηση, τεχνητή νοημοσύνη και υπολογιστικές μεθόδους για ανακάλυψη αιτιότητας.",
    "people_text_en": "He received his Ph.D. in 2001 from Pittsburgh University, USA. His research interests are in the broader areas of Machine Learning, Bioinformatics, and Artificial Intelligence.",
    "people_img_src": "ioannistsamardinos.jpg",
    "position_id": "1"
},
{
    "people_id": "17",
    "people_name": "Γιώργος Γεωργακόπουλος",
    "people_name_en": "Georgios Georgakopoulos",
    "people_email": "ggeo@csd.uoc.gr",
    "people_ext_url": "",
    "people_text": "Πήρε το Διδακτορικό του το 1989 από τον Τομέα Πληροφορικής του Τμήματος Ηλεκτρολόγων του Εθν. Μετσ. Πολυτεχνείου Αθηνών. Τα ενδιαφέροντα του περιλαμβάνουν Θεωρία Υπολογισμού και Αλγόριθμους (ειδικότερα γράφων και γεωμετρίας) καθώς και Θεωρία Υπολογιστικής Πολυπλοκότητας.",
    "people_text_en": "He received his PhD in 1989 from the National Technical University of Athens, Greece. His research interests are in the broader area of Theory of Computation and Algorithms.",
    "people_img_src": "georgiosgeorgakopoulos.jpg",
    "position_id": "2"
},
{
    "people_id": "18",
    "people_name": "Μαρία Παπαδοπούλη",
    "people_name_en": "Maria Papadopouli",
    "people_email": "maria@csd.uoc.gr",
    "people_ext_url": "http:\/\/www.csd.uoc.gr\/~maria",
    "people_text": "Πήρε το διδακτορικό της το 2002 από το Πανεπιστήμιο Columbia, στις Η.Π.Α. Εργάστηκε ως επίκουρη καθηγήτηρια στο Πανεπιστήμιο της Βόρειας Καρολίνας στο Chapel Hill (UNC).<br \/>\r\nΤα ενδιαφέροντά της περιλαμβάνουν ασύρματα κινητά δίκτυα, συστήματα εύρεσης θέσης, ανάλυση και βελτιστοποίηση απόδοσης δικτύων, σχεδιασμό και μελέτη συστημάτων υποστήριξης ασυρμάτων δικτύων (capacity planning, load balancing).",
    "people_text_en": "She received her PhD in 2002 from Columbia University, USA. Her research interests are in the broader area of Networks, Telecommunications, and Systems (Wireless Networks, Network Measurements and Modeling, Mobile Computing, Mobile P2P Computing, Cognitive Radios, Positioning Systems, Network monitoring, Internet systems and technologies, Pervasive Computing, Multimedia Systems).",
    "people_img_src": "mariapapadopouli.jpg",
    "position_id": "1"
},
{
    "people_id": "19",
    "people_name": "Γεώργιος Παπαγιαννάκης",
    "people_name_en": "Georgios Papagiannakis",
    "people_email": "papagian@csd.uoc.gr",
    "people_ext_url": "http:\/\/www.csd.uoc.gr\/~papagian",
    "people_text": "Ο Γιώργος Παπαγιαννάκης πήρε το διδακτορικό του το 2006 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου της Γενεύης, Ελβετία όπου εργάστηκε σαν ερευνητής μέχρι το 2009. Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν τις περιοχές μεικτής πραγματικότητας, διαδραστικά γραφικά υπολογιστών, μοντέλα φωτισμού, απόδοση σε πραγματικό χρόνο, εικονική προσομοίωση συστημάτων, προγραμματισμό επιταχυντών γραφικών επεξεργαστών και ολοκληρωμένα συστήματα προσομοίωσης εικονικών χαρακτήρων.",
    "people_text_en": "He received his PhD in 2006 from the University of Geneva in Switzerland. His research and development interests are confined in the areas of mixed reality presence, illumination models and real-time rendering, interactive graphics, virtual heritage, GPU programming and real-time frameworks-engines for integrated VR\/AR character simulation.",
    "people_img_src": "georgiospapagiannakis.jpg",
    "position_id": "2"
},
{
    "people_id": "21",
    "people_name": "Γιάννης Τζίτζικας",
    "people_name_en": "Yannis Tzitzikas",
    "people_email": "tzitzik@csd.uoc.gr",
    "people_ext_url": "http:\/\/www.ics.forth.gr\/~tzitzik\/",
    "people_text": "Πήρε το διδακτορικό του το 2002 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Ήταν μεταδιδακτορικός ερευνητής στα: (α) Πανεπιστήμιο της Ναμύρ (FUNDP-Βέλγιο), (β) Εθνικό Συμβούλιο Ερευνών της Ιταλίας (CNR-ISTI, Pisa), και (γ) Τεχνολογικό Ερευνητικό Κέντρο της Φιλανδίας (VTT, Espoo). Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν θέματα Ευρετηρίασης, Ανάκτησης και Εξερεύνησης Πληροφοριών καθώς και θέματα Διαχείρισης Σημασιολογικών Δεδομένων με έμφαση στην Εξέλιξη Γνώσης.",
    "people_text_en": "He received his PhD in 2002 from the University of Crete, Greece. &nbsp;He was postdoctoral researcher at the University of Namur (Belgium) and ERCIM postdoctoral fellow at ISTI-CNR (Pisa, Italy) and at VTT Technical Research Centre of Finland. His research interests are in the broader areas of Information Indexing, Retrieval and Exploration, and Semantic Data Management with emphasis on Knowledge Evolution.",
    "people_img_src": "yannistzitzikas.jpg",
    "position_id": "1"
},
{
    "people_id": "22",
    "people_name": "Παναγιώτα Φατούρου",
    "people_name_en": "Panagiota Fatourou",
    "people_email": "faturu@csd.uoc.gr",
    "people_ext_url": "http:\/\/www.ics.forth.gr\/~faturu\/",
    "people_text": "Πήρε το διδακτορικό της το 1999 από το Πανεπιστήμιο Πατρών. Εργάστηκε ως μεταδιδακτορικός ερευνήτρια στο <a href=\"http:\/\/www.mpi-sb.mpg.de\/\">Max-Planck Institut f&uuml;r Informatik<\/a> στη Γερμανία και στο <a href=\"http:\/\/www.cs.toronto.edu\/\">Computer Science Department<\/a> του Πανεπιστημίου του Τορόντο στον Καναδά. Έχει επίσης εργαστεί ως επισκέπτρια καθηγήτρια (και ως επισκέπτρια καθηγήτρια στα πλαίσια του προγράμματος Ecocloud) &nbsp;στο <a href=\"http:\/\/ic.epfl.ch\/en\">School of Computer and Communication Sciences<\/a> του <a href=\"https:\/\/www.epfl.ch\/\">&Eacute;cole Polytechnique F&eacute;d&eacute;rale de Lausanne<\/a> στην Ελβετία. Κατείχε θέση Λέκτορα και Επίκουρου Καθηγήτριας στο Τμήμα Μηχανικών Ηλεκτρονικών Υπολογιστών και Πληροφορικής του Πανεπιστημίου Ιωαννίνων. Τα ενδιαφέροντα της επικεντρώνονται στις περιοχές του Κατανεμημένου και Παράλληλου Υπολογισμού, των Αλγορίθμων και της Πολυπλοκότητας, καθώς και στην Πειραματική Ανάλυση Αλγορίθμων.",
    "people_text_en": "She received her PhD in 1999 from the University of Patras, Greece. Her research interests are in the broader areas of Distributed and Parallel Computing, Algorithms and Complexity, and Experimental Algorithmics.",
    "people_img_src": "PanagiotaFatourou-photo-1.jpg",
    "position_id": "1"
},
{
    "people_id": "23",
    "people_name": "Ξενοφώντας Δημητρόπουλος",
    "people_name_en": "Xenofontas Dimitropoulos",
    "people_email": "xd@csd.uoc.gr",
    "people_ext_url": "http:\/\/www.inspire.edu.gr\/%7Efontas\/",
    "people_text": "<div><span style=\"margin:0px;padding:0px;text-align:justify\"><font color=\"#212c38\" face=\"Roboto, tahoma, sans-serif\"><span style=\"font-size:14px\">Πήρε το Διδακτορικό του&nbsp;<\/span><\/font><\/span><span style=\"color:rgb(33,44,56);font-family:Roboto,tahoma,sans-serif;font-size:14px;text-align:justify\">από το Πανεπιστήμιο Georgia Institute of Technology της Ατλάντα, ΗΠΑ, το 2006.&nbsp;<\/span><span style=\"font-size:14px;color:rgb(33,44,56);font-family:Roboto,tahoma,sans-serif;text-align:justify\">Η έρευνά του επικεντρώνεται σε Μετρήσεις Διαδικτύου και σε Software Defined Networks. Έχει λάβει επιχορηγήσεις από το&nbsp;<\/span><span style=\"color:rgb(33,44,56);font-family:Roboto,tahoma,sans-serif;font-size:14px;text-align:justify\">Ευρωπαϊκό Συμβούλιο Έρευνας, τη δράση Marie Skłodowska-Curie και το Ίδρυμα Fulbright. Έχει υπηρετήσει στην επιτροπή προγράμματος του &nbsp;ACM SIGCOMM και έχει κερδίσει δύο βραβεία καλύτερης δημοσίευσης. Ηγείται του&nbsp;<\/span><a href=\"http:\/\/inspire.edu.gr\/\" style=\"color:rgb(50,114,150);margin:0px;padding:0px;font-weight:700;text-decoration-line:none;font-family:Roboto,tahoma,sans-serif;font-size:14px;text-align:justify\">Internet Security,&nbsp;Privacy, and&nbsp;Intelligence Research (INSPIRE) Group<\/a><font color=\"#212c38\" face=\"Roboto, tahoma, sans-serif\"><span style=\"font-size:14px\">.<\/span><\/font><\/div>\r\n",
    "people_text_en": "<div><span style=\"margin:0px;padding:0px;color:rgb(33,44,56);font-family:Roboto,tahoma,sans-serif;font-size:14px;text-align:justify\">He received a PhD degree from the Georgia Institute of Technology. His research focuses on&nbsp;<\/span><span style=\"margin:0px;padding:0px;color:rgb(33,44,56);font-family:Roboto,tahoma,sans-serif;font-size:14px;text-align:justify\">Internet measurements and&nbsp;<\/span><span style=\"margin:0px;padding:0px;color:rgb(33,44,56);font-family:Roboto,tahoma,sans-serif;font-size:14px;text-align:justify\">software defined networks. He has received grants from the European Research Council, the Marie Skłodowska-Curie Action, and the Fulbright Foundation. He has served on the program committee of ACM SIGCOMM and has won two best paper awards. He&nbsp;<\/span><span style=\"margin:0px;padding:0px;color:rgb(33,44,56);font-family:Roboto,tahoma,sans-serif;font-size:14px;text-align:justify\">leads the&nbsp;<\/span><a href=\"http:\/\/inspire.edu.gr\/\" style=\"color:rgb(50,114,150);margin:0px;padding:0px;font-weight:700;text-decoration-line:none;font-family:Roboto,tahoma,sans-serif;font-size:14px;text-align:justify\">Internet Security,&nbsp;Privacy, and&nbsp;Intelligence Research (INSPIRE) Group<\/a><span style=\"margin:0px;padding:0px;color:rgb(33,44,56);font-family:Roboto,tahoma,sans-serif;font-size:14px;text-align:justify\">.&nbsp;<\/span><\/div>\r\n",
    "people_img_src": "christosxenofontasdhmhtropoulos.jpg",
    "position_id": "2"
},
{
    "people_id": "66",
    "people_name": "Χρήστος Κοζανίτης",
    "people_name_en": "Christos Kozanitis",
    "people_email": "kozanitis@ics.forth.gr",
    "people_ext_url": "",
    "people_text": "Πήρε το διδακτορικό του στην Επιστήμη Υπολογιστών το 2013 από το University of California, San Diego. Τα ερευνητικά του ενδιαφέροντα επικεντρώνονται στην ανάλυση μεγάλου όγκου δεδομένων, τεχνολογίες Cloud Computing, και Cluster Management.",
    "people_text_en": "He received his PhD in Computer Science from the University of California, San Diego in 2013. His research interests include Big Data Analytics, Cloud Computing, and Cluster Management.",
    "people_img_src": "kozanitisPhoto.jpg",
    "position_id": "4"
},
{
    "people_id": "63",
    "people_name": "Χρυσόστομος Ζεγκίνης",
    "people_name_en": "Chrysostomos Zeginis",
    "people_email": "zegchris@csd.uoc.gr",
    "people_ext_url": "http:\/\/www.ics.forth.gr\/~zegchris",
    "people_text": "<p><span new=\"\" roboto=\"\" style=\"color:rgba(0,0,0,0.87);font-family:\" times=\"\">Πήρε το διδακτορικό του το 2014 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν την παρακολούθηση και προσαρμογή υπηρεσιών διαδικτύου, την ανακάλυψη και ανίχνευση μοτίβων γεγονότων και την επεξεργασία σύνθετων συμβάντων (CEP) σε περιβάλλοντα υπηρεσιοστρεφούς αρχιτεκτονικής και υπολογιστικού νέφους (Cloud). <\/span><\/p>\r\n",
    "people_text_en": "<p><font color=\"rgba(0, 0, 0, 0.870588235294118)\" face=\"Roboto Slab, Times New Roman, serif\"><span style=\"font-size:14px;font-variant-ligatures:none;white-space:pre-wrap;background-color:rgb(250,250,250)\"><span style=\"color:rgb(33,44,56);font-family:Roboto,tahoma,sans-serif;font-variant-ligatures:normal;text-align:justify;white-space:normal;background-color:rgb(255,255,255);text-decoration-style:initial;text-decoration-color:initial;float:none;display:inline\">He received his PhD in 2014 from the Computer Science Department of University of Crete. His research interests include<span>&nbsp;monitoring and adaptation of Web services, discovery&nbsp;of event patterns and Complex Event Processing in SOA and Cloud computing environments.<\/span><\/span><\/span><\/font><\/p>\r\n",
    "people_img_src": "chrysostomos-zeginis.png",
    "position_id": "4"
},
{
    "people_id": "64",
    "people_name": "Νικόλαος Χρυσός",
    "people_name_en": "Nikolaos Chrysos",
    "people_email": "nchrysos@ics.forth.gr",
    "people_ext_url": "http:\/\/users.ics.forth.gr\/%7Enchrysos\/",
    "people_text": "Πήρε το διδακτορικό του το 2007 από το Πανεπιστήμιο Κρήτης. Τα ερευνητικά του ενδιαφέροντα επικεντρώνονται στην αρχιτεκτονική υπολογιστών, δικτύων, και παράλληλων συστημάτων.",
    "people_text_en": "He received his PhD in 2007 from the University of Crete, Greece. His current research interests include Computer Architecture, networks and parallel systems.",
    "people_img_src": "new_nikos_chrysos.JPG",
    "position_id": "4"
},
{
    "people_id": "33",
    "people_name": "Πολύβιος Πρατικάκης",
    "people_name_en": "Polyvios Pratikakis",
    "people_email": "polyvios@csd.uoc.gr",
    "people_ext_url": "http:\/\/www.ics.forth.gr\/~polyvios\/",
    "people_text": "Πήρε το διδακτορικό του το 2008 από το Πανεπιστήμιο του Μέριλαντ.&nbsp; Τα ερευνητικά του ενδιαφέροντα εστιάζουν στην βελτίωση της ποιότητας του λογισμικού, και περιλαμβάνουν περιοχές όπως οι γλώσσες προγραμματισμού, τα συστήματα τύπων, η στατική ανάλυση, ο παραλληλισμός, η πιστοποίηση και ορθότητα προγραμμάτων και οι μηχανικές αποδείξεις.",
    "people_text_en": "He <span>received <\/span>his PhD in 2008 from the University of Maryland, USA. His research interests include Programming Languages, Software Engineering, Type Systems and Static Analysis, and their Applications on Concurrent Software.",
    "people_img_src": "polyviospratikakhs.jpg",
    "position_id": "2"
},
{
    "people_id": "67",
    "people_name": "Βασίλης Παπαευσταθίου",
    "people_name_en": "Vassilis Papaefstathiou ",
    "people_email": "papaef@ics.forth.gr",
    "people_ext_url": "",
    "people_text": "Πήρε το διδακτορικό του το 2014 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Τα ερευνητικά του ενδιαφέροντα επικεντρώνονται στην αρχιτεκτονική υπολογιστών, τα ψηφιακά κυκλώματα και διατάξεις προγραμματιζόμενης λογικής, τα υπολογιστικά συστήματα υψηλών επιδόσεων και τα δίκτυα διασύνδεσης υψηλών ταχυτήτων.",
    "people_text_en": "He received his PhD in 2014 from the Computer Science Department of the University of Crete. His research interests include computer architecture, digital circuits and FPGA prototyping, high-performance computing and high-speed interconnects.",
    "people_img_src": "vpapaefstathiou_200x200.jpg",
    "position_id": "4"
},
{
    "people_id": "68",
    "people_name": "Εμμανουήλ Μαραζάκης",
    "people_name_en": "Manolis Marazakis",
    "people_email": "maraz@csd.uoc.gr",
    "people_ext_url": "https:\/\/www.linkedin.com\/in\/mmarazakis\/",
    "people_text": "Πήρε το διδακτορικό του στην Επιστήμη Υπολογιστών το 2001 από το Πανεπιστήμιο Κρήτης. Τα ερευνητικά του ενδιαφέροντα επικεντρώνονται στην σχεδίαση, ανάπτυξη, ανάλυση και πειραματική αξιολόγηση υπολογιστικών συστημάτων υψηλής επίδοσης και συστημάτων απόθήκευσης δεδομένων.",
    "people_text_en": "He received his PhD in Computer Science in 2001, from the University of Crete. His research interests focus on the design, development, analysis and experimental evaluation of high-performance computing systems, and data storage systems.",
    "people_img_src": "manolis_marazakis_linkedin_photo.png",
    "position_id": "4"
},
{
    "people_id": "69",
    "people_name": "Παύλος Παυλίδης",
    "people_name_en": "Pavlos Pavlidis",
    "people_email": "pavlidis@ics.forth.gr",
    "people_ext_url": "https:\/\/www.ics.forth.gr\/cbml\/index_main.php?l=g&c=723",
    "people_text": "Πήρε το Διδακτορικό του από το Πανεπιστήμιο του Μονάχου υπό την επίβλεψη του καθ. Wolfgang Stephan. Τα ερευνητικά του ενδιαφέροντα εστιάζονται στον χώρο της εξελικτικής βιολογίας. Συγκεκριμένα, στο πεδίο της υπολογιστικής πληθυσμιακής γενετικής και της εξέλιξης των πληθυσμών. Με την έρευνα του επιδιώκει να απαντήσει τα ερωτήματα: &quot;Γιατί οι φυσικοί πληθυσμοί&#39; έχουν την παρούσα γενετική σύσταση; Πώς αυτή έχει εξελιχθεί στο χρόνο και στον χώρο; Ποιες δυνάμεις και διαδικασίες βρίσκονται πίσω από την εξέλιξη των πληθυσμών;",
    "people_text_en": "&nbsp;He received his Ph.D. degree in 2011 (summa cum laude) from the University of Munich, Germany under the supervision of Prof. Wolfgang Stephan. His expertise and research lies on the computational and theoretical population genetics and evolutionary biology. He is also interested in Bioinformatics on genomics data.",
    "people_img_src": "pavlidis.jpeg",
    "position_id": "4"
},
{
    "people_id": "39",
    "people_name": "Στέφανος Παπαδάκης",
    "people_name_en": "Stefanos Papadakis",
    "people_email": "",
    "people_ext_url": "",
    "people_text": "Πήρε το Διδακτορικό του το 2009 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Τα ενδιαφέροντα του περιλαμβάνουν: Ασύρματες Κινητές Επικοινωνίες, Εντοπισμός θέσης συσκευών ασυρμάτων και κινητών δικτύων, Διάδοση μικροκυμάτων και απώλειες διάδοσης.",
    "people_text_en": "",
    "people_img_src": "stefpap100x100.jpg",
    "position_id": "4"
},
{
    "people_id": "71",
    "people_name": "Συραγώ Τσιαμπαλού",
    "people_name_en": "Syrago Tsiambalou",
    "people_email": "syrago@csd.uoc.gr",
    "people_ext_url": "",
    "people_text": "Γραμματεία Προπτυχιακών Σπουδών",
    "people_text_en": "Secretariat of Undergraduate Studies",
    "people_img_src": "Syrago.jpg",
    "position_id": "6"
},
{
    "people_id": "41",
    "people_name": "Παναγιώτα Ριζοπούλου",
    "people_name_en": "Panagiota Rizopoulou",
    "people_email": "nrizop@csd.uoc.gr",
    "people_ext_url": "",
    "people_text": "Πήρε το MA της από το University of Sussex στον τομέα Applied Linguistics (Εφαρμοσμένη Γλωσσολογία).",
    "people_text_en": "She obtained her Master&#39;s Degree from the University of Sussex in the field of Applied Linguistics.",
    "people_img_src": "panagiota-rizopoulou2.jpg",
    "position_id": "5"
},
{
    "people_id": "42",
    "people_name": "Ρένα Καλαϊτζάκη",
    "people_name_en": "Rena Kalaitzaki",
    "people_email": "rena@csd.uoc.gr",
    "people_ext_url": "",
    "people_text": "Προϊσταμένη Γραμματείας",
    "people_text_en": "<div class=\"entity-info\">\r\n<p class=\"entity-headline\">Head of the Secretariat of the Computer Science Department<\/p>\r\n<\/div>\r\n\r\n<div class=\"entity-info\">\r\n<p class=\"entity-subheading\">&nbsp;<\/p>\r\n<\/div>\r\n",
    "people_img_src": "Rena-Kalaitzaki.jpg",
    "position_id": "6"
},
{
    "people_id": "44",
    "people_name": "Στέλλα Συντιχάκη",
    "people_name_en": "Stella Syntichaki",
    "people_email": "sintis@csd.uoc.gr",
    "people_ext_url": "",
    "people_text": "Γραμματεία Προπτυχιακών Σπουδών",
    "people_text_en": "Secretariat of Undergraduate Studies",
    "people_img_src": "Stella-Syntixaki.jpg",
    "position_id": "6"
},
{
    "people_id": "45",
    "people_name": "Ευαγγελία Κοσμά",
    "people_name_en": "Gelly Kosma",
    "people_email": "kosma@csd.uoc.gr",
    "people_ext_url": "",
    "people_text": "Γραμματεία Μεταπτυχιακών Σπουδών",
    "people_text_en": "Secretariat of Graduate Studies",
    "people_img_src": "Euaggelia-Kosma.jpg",
    "position_id": "6"
},
{
    "people_id": "47",
    "people_name": "Μαρία Μαμαλάκη",
    "people_name_en": "Maria Mamalaki",
    "people_email": "mariam@csd.uoc.gr",
    "people_ext_url": "http:\/\/www.csd.uoc.gr\/~mariam",
    "people_text": "Πήρε το Πτυχίο της το 1983 από το Τμήμα&nbsp; Μαθηματικών του Πανεπιστημίου Κρήτης. Μετεκπαίδευση στην Πληροφορική στο Τμήμα Επιστήμης Υπολογιστών 1985-1986. Διδασκαλία \/ επικουρία στα φροντιστηριακά μαθήματα του Προγραμματισμού και των Διακριτών Μαθηματικών",
    "people_text_en": "",
    "people_img_src": "",
    "position_id": "7"
},
{
    "people_id": "48",
    "people_name": "Γιάννης Φραγκιαδάκης",
    "people_name_en": "Giannis Fragkiadakis",
    "people_email": "jfragiad@ucnet.uoc.gr",
    "people_ext_url": "",
    "people_text": "",
    "people_text_en": "",
    "people_img_src": "Yannis-Fragiadakis.jpg",
    "position_id": "8"
},
{
    "people_id": "50",
    "people_name": "Νίκος Κρασσάς",
    "people_name_en": "Nikos Krassas",
    "people_email": "nkrassas@csd.uoc.gr",
    "people_ext_url": "",
    "people_text": "",
    "people_text_en": "",
    "people_img_src": "",
    "position_id": "8"
},
{
    "people_id": "51",
    "people_name": "Γιάννης Σουρλαντζής",
    "people_name_en": "Giannis Surlatzis",
    "people_email": "surlatzi@csd.uoc.gr",
    "people_ext_url": "",
    "people_text": "",
    "people_text_en": "",
    "people_img_src": "",
    "position_id": "8"
},
{
    "people_id": "75",
    "people_name": "Νικόλαος Κομοντάκης",
    "people_name_en": "Nikos Komodakis",
    "people_email": "komod@csd.uoc.gr",
    "people_ext_url": "http:\/\/www.csd.uoc.gr\/~komod",
    "people_text": "<div><span style=\"font-size:14px;\">Ο Νικόλαος Κομοντάκης είναι Επίκουρος Καθηγητής στο Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Προηγουμένως έχει διατελέσει Αναπληρωτής Καθηγητής στην ανώτατη σχολή Ecole des Ponts ParisTech. Έχει επίσης υπηρετήσει ως ερευνητής στο CNRS, ως επισκέπτης καθηγητής στην ανώτατη σχολή Ecole Normale Superieure de Cachan και ως μεταδιδακτορικός ερευνητής στην ανώτατη σχολή Ecole Centrale de Paris. Έλαβε το διδακτορικό του από το τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης και το δίπλωμα &ldquo;habilitation to direct research&rdquo; (Habilitation &agrave; Diriger des Recherches) από το πανεπιστήμιο Universite Paris-Est. Τα επιστημονικά του ενδιαφέροντα περιλαμβάνουν τα Τεχνητά Νευρωνικά Δίκτυα, τη Μηχανική Μάθηση, και την Υπολογιστική Όραση\/Ανάλυση Εικόνων. Έχει υπηρετήσει πολλαπλές φορές ως Area Chair στα κορυφαία διεθνή συνέδρια υπολογιστικής όρασης (CVPR, ICCV, ECCV) και είναι μέλος της Συντακτικής Επιτροπής των επιστημονικών περιοδικών Computer Vision and Image Understanding Journal, International Journal of Computer Vision and Computational Intelligence Journal.<\/span><br \/>\r\n<br \/>\r\n<br \/>\r\n&nbsp;<\/div>\r\n",
    "people_text_en": "<span style=\"font-size:14px;\">Nikos Komodakis is an Assistant Professor at the Computer Science Department, University of Crete. Prior to that, he has held an Associate Professor position at Ecole des Ponts ParisTech. He has also been a research scientist at CNRS, a visiting Professor at Ecole Normale Superieure de Cachan and a post-doctoral researcher at Ecole Centrale de Paris. He received his PhD from the Computer Science Department, University of Crete and his &ldquo;habilitation to direct research&rdquo; (Habilitation &agrave; Diriger des Recherches) from the University of Paris-Est. His research interests are in the areas of Deep Learning, Machine Learning and Computer Vision\/Image Analysis. He has served multiple times as Area Chair in the major computer vision conferences (CVPR, ICCV, ECCV) and is an Editorial Board Member\/Associate Editor of the Computer Vision and Image Understanding Journal, International Journal of Computer Vision and Computational Intelligence Journal.<\/span>",
    "people_img_src": "Nikos_Komodakis.png",
    "position_id": "3"
},
{
    "people_id": "77",
    "people_name": "Χαράλαμπος Μανιφάβας",
    "people_name_en": "Harry Manifavas",
    "people_email": "harryman@ics.forth.gr",
    "people_ext_url": "",
    "people_text": "Πήρε το διδακτορικό του το 2003 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Cambridge στη Μεγάλη Βρετανία. Τα ενδιαφέροντά του περιλαμβάνουν: Κρυπτογραφία, Κυβερνοασφάλεια, Κυβερνοέγκλημα και Ψηφιακή Εγκληματολογία.",
    "people_text_en": "He received his PhD from the Computer Science Department of the University of Cambridge in 2003. His research interests include Cryptography, Cybersecurity, Cybercrime and Digital Forensics.",
    "people_img_src": "cmx-pic_manivavas.jpg",
    "position_id": "4"
},
{
    "people_id": "56",
    "people_name": "Γεώργιος Καφεντζής",
    "people_name_en": "George Kafentzis",
    "people_email": "kafentz@csd.uoc.gr",
    "people_ext_url": "http:\/\/www.csd.uoc.gr\/~kafentz\/",
    "people_text": "Πήρε το διδακτορικό του το 2014 στην Επιστήμη των Υπολογιστών από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου&nbsp; Κρήτης&nbsp; και στην Επεξεργασία Σήματος &amp; Τηλ\/νιες από το Πανεπιστήμιο της Rennes 1, στη Γαλλία. Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν επεξεργασία σήματος φωνής και ήχου, με έμφαση στα ημιτονοειδη μοντέλα και τις εφαρμογές τους.",
    "people_text_en": "He <span>received <\/span>his PhD in 2014 in Computer Science from the Computer Science Department of the University of Crete and in Signal Processing &amp; Telecommunications from the University of Rennes 1, France. His research interests include speech and audio signal processing, with emphasis on sinusoidal models and their applications.",
    "people_img_src": "kafentzis.jpg",
    "position_id": "4"
},
{
    "people_id": "57",
    "people_name": "Χαρίδημος Κονδυλάκης",
    "people_name_en": "Haridimos Kondylakis",
    "people_email": "kondylak@ics.forth.gr",
    "people_ext_url": "http:\/\/users.ics.forth.gr\/~kondylak\/",
    "people_text": "Πήρε το διδακτορικό του το 2010 από το Πανεπιστήμιο Κρήτης. Τα ερευνητικά του ενδιαφέροντα επικεντρώνονται στην αναπαράσταση και διαχείριση γνώσης, σε συστήματα ολοκλήρωσης και ανάκτησης πληροφορίας, στην διαλειτουργικότητα ετερογενών και κατανεμημένων συστημάτων διαχείρισης πληροφορίας καθώς και σε συστήματα βιοπληροφορικής, ιατρικής και υγείας.",
    "people_text_en": "He received his PhD in 2010 from the University of Crete, Greece. His current research interests include Knowledge Representation &amp; Management; Web Databases; Information Integration and Retrieval Systems; Interoperability of Heterogeneous and Distributed Information Bases; Biomedical Information Systems.",
    "people_img_src": "Kondylakis_b.jpg",
    "position_id": "4"
},
{
    "people_id": "58",
    "people_name": "Αννα Σφακιανάκη",
    "people_name_en": "Anna Sfakianaki",
    "people_email": "asfakianaki@csd.uoc.gr",
    "people_ext_url": "http:\/\/www.csd.uoc.gr\/~asfakianaki\/ ",
    "people_text": "Είναι Φωνητικός\/Γλωσσολόγος (MA, PhD) και Παιδαγωγός (BA, PGDip). Έχει εργαστεί ως επισκέπτης Λέκτορας στο Leeds Metropolitan University (UK) και στο Πανεπιστήμιο Κρήτης, και ως Ερευνήτρια στα University of Reading (UK), Αριστοτέλειο Πανεπιστήμιο Θεσσαλονίκης, κ.ά. Επίσης, έχει υπηρετήσει ως Δασκάλα στην γενική και ειδική εκπαίδευση (2004-2017). Τα ενδιαφέροντά της εμπίπτουν κυρίως στο χώρο των Επιστημών Λόγου και Ακοής, με ιδιαίτερη έμφαση στην παραγωγή και αντίληψη φυσιολογικής και παθολογικής ομιλίας και στη διδασκαλία της γλώσσας και της προφοράς με τη χρήση νέων τεχνολογιών.<br \/>\r\n<br \/>\r\n&nbsp;",
    "people_text_en": "She is a Phonetician\/Linguist (MA, PhD) and Educator (BA, PGDip). She has worked as an Adjunct Lecturer at Leeds Metropolitan University (UK) and at the University of Crete, and as a Researcher at the University of Reading (UK), the Aristotle University of Thessaloniki and others. She has also served as a Primary School Teacher in mainstream and special education settings (2004-2017). Her research interests lie mainly in the field of Speech and Hearing Sciences, and especially in normal and disordered speech production and perception, as well as in language and pronunciation teaching using new technologies.<br \/>\r\n&nbsp;",
    "people_img_src": "photo_Anna.jpg",
    "position_id": "7"
},
{
    "people_id": "72",
    "people_name": "Κωνσταντίνος Μαγκούτης",
    "people_name_en": "Kostas Magoutis",
    "people_email": "magoutis@csd.uoc.gr",
    "people_ext_url": "http:\/\/www.csd.uoc.gr\/~magoutis",
    "people_text": "<span lang=\"EL\" style=\"font-size:10.5pt;font-family:\">Πήρε το Διδακτορικό του το 2003 από το Πανεπιστήμιο <\/span><span style=\"font-size:10.5pt;font-family:\">Harvard<\/span><span lang=\"EL\" style=\"font-size:10.5pt;font-family:\"> στις Η.Π.Α.<\/span><span style=\"font-size:10.5pt;font-family:\">&nbsp;<\/span><span style=\"font-size:10.5pt;font-family:\"> <span lang=\"EL\">Τα ερευνητικά του ενδιαφέροντα εστιάζονται στα κλιμακώσιμα υπολογιστικά συστήματα, στις υπηρεσίες δεδομένων, και στην βελτίωση της απόδοσης, διαθεσιμότητας και διαχειρισιμότητας κατανεμημένων συστημάτων λογισμικού.<\/span><\/span>",
    "people_text_en": "He received his Ph.D. in 2003 from Harvard University, USA. His research interests are in the broader areas of scalable distributed systems and data services.",
    "people_img_src": "kmicon_magoutis.jpg",
    "position_id": "2"
},
{
    "people_id": "60",
    "people_name": "Γρηγόριος Τσαγκατάκης",
    "people_name_en": "Grigorios Tsagkatakis",
    "people_email": "greg@ics.forth.gr",
    "people_ext_url": "",
    "people_text": "Πήρε το διδακτορικό του το 2011 από το Κέντρο Επιστήμης Εικόνας του Τεχνολογικού Ινστιτούτου του Ρότσεστερ στην Νέα Υόρκη. Τα ερευνητικά του ενδιαφέροντα εστιάζονται στην ανάπτυξη συστημάτων επεξεργασίας σήματος και μηχανικής μάθησης και τις εφαρμογές τους σε προβλήματα αστροφυσικής, τηλεπισκόπησης &nbsp;και ασύρματων δικτύων αισθητήρων.&nbsp;&nbsp;",
    "people_text_en": "He received his PhD in 2011 from the Center for Imaging Science, Rochester Institute of Technology, New York. His research interests focus on the development of signal processing and machine leaning systems, and their application in astrophysics, remote sensing, and wireless sensor networks.",
    "people_img_src": "GrigorisTzagatakis150x150.jpg",
    "position_id": "4"
},
{
    "people_id": "62",
    "people_name": "Iωάννης Λιλής",
    "people_name_en": "Yannis Lilis",
    "people_email": "lilis@csd.uoc.gr",
    "people_ext_url": "",
    "people_text": "Πήρε το διδακτορικό του το 2014 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου&nbsp; Κρήτης. Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν σχεδιασμό και ανάπτυξη γλωσσών προγραμματισμού, γλώσσες και μεθόδους μεταπρογραμματισμού, ολοκληρωμένα περιβάλλοντας ανάπτυξης λογισμικού, εργαλεία τεχνολογίας λογισμικού και εργαλεία ανάπτυξης παιχνιδιών.",
    "people_text_en": "He received his PhD in 2014 from the Computer Science Department of University of Crete. His research interests include programming language design and development, metaprogramming languages and methods, integrated development environments, software engineering tools and game development tools.",
    "people_img_src": "yannis_lilis.jpg",
    "position_id": "4"
},
{
    "people_id": "59",
    "people_name": "Μάριος Πιτικάκης",
    "people_name_en": "Marios Pitikakis",
    "people_email": "pitikakis@csd.uoc.gr",
    "people_ext_url": "http:\/\/www.csd.uoc.gr\/~pitikakis",
    "people_text": "Πήρε το Διδακτορικό του το 2011 από το Τμήμα Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών του Πανεπιστημίου Θεσσαλίας. Ήταν μεταδιδακτορικός ερευνητής - Marie Curie Fellow (ER) - για 2 χρόνια στην Ιταλία (Softeco Sismat S.r.l.). Τα ενδιαφέροντά του περιλαμβάνουν: Διαχείριση Σημασιολογικών Δεδομένων, Βάσεων Γνώσεων και Συστημάτων Στήριξης Αποφάσεων, Ανάλυση Πληροφορίας\/Δεδομένων, Ιατρική Πληροφορική με έμφαση στα Συστήματα Αυτόματης Διάγνωσης με χρήση Ιατρικών Εικόνων, Τρισδιάστατων Γραφικών και Προσομοιώσεων.",
    "people_text_en": "He received his Ph.D. in 2011 from the Department of Electrical and Computer Engineering, University of Thessaly, Greece. He was a PostDoctoral Researcher - Marie Curie Fellow (ER) - for 2 years in Genoa, Italy (at Softeco Sismat S.r.l.). His research interests include: Semantic Data Management, Knowledge Bases and Decision Support Systems, Data\/Information Analysis, Medical Informatics with emphasis on Computer Aided Diagnosis\/Detection, Medical image analysis\/processing and 3D visualization.",
    "people_img_src": "pitikakis.jpg",
    "position_id": "7"
},
{
    "people_id": "78",
    "people_name": "Μιχάλης Μουνταντωνάκης",
    "people_name_en": "Michalis Mountantonakis",
    "people_email": "mountant@ics.forth.gr",
    "people_ext_url": "http:\/\/users.ics.forth.gr\/~mountant\/",
    "people_text": "Πήρε το διδακτορικό του το 2020 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης.&nbsp; Τα ερευνητικά του ενδιαφέροντα επικεντρώνονται στην Σημασιολογική Ολοκλήρωση Δεδομένων σε μεγάλη κλίμακα, στον Σημασιολογικό Ιστό, στα Ανοιχτά Διασυνδεδεμένα Δεδομένα και στη Διαχείριση Δεδομένων.",
    "people_text_en": "He received his PhD in 2020 from the Computer Science Department of University of Crete. His research interests fall in the areas of Large-Scale Semantic Data Integration, Semantic Web,&nbsp; Linked Open Data and Data Management.",
    "people_img_src": "michmountant.png",
    "position_id": "4"
},
{
    "people_id": "79",
    "people_name": "Φοίβος Ζακκάκ",
    "people_name_en": "Foivos Zakkak",
    "people_email": "foivos@zakkak.net",
    "people_ext_url": "https:\/\/foivos.zakkak.net",
    "people_text": "Πήρε το διδακτορικό του το 2016 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Τα ερευνητικά του ενδιαφέροντα εστιάζουν στα Συ<span>στήματα Εκτέλεσης Δυναμικών Γλωσσών Προγραμματισμού<\/span>, την Διαχείριση Μνήμης σε επίπεδο λογισμικού, τον Παράλληλο Προγραμματισμό, και το Λογισμικό Συστημάτων.",
    "people_text_en": "<span>He received his PhD in 2016 from the Computer Science Department of the University of Crete. His research interests include Managed Runtime Systems, Memory Management, Parallel Computing and Systems Software.<\/span>",
    "people_img_src": "zakkak1.png",
    "position_id": "4"
},
{
    "people_id": "73",
    "people_name": "Νίκος Τσατσάκης",
    "people_name_en": "Nikos Tsatsakis",
    "people_email": "nikost@csd.uoc.gr",
    "people_ext_url": "",
    "people_text": "Υποστήριξη ηλεκτρονικών υπηρεσιών και υπηρεσιών προβολής του Τμήματος",
    "people_text_en": "Support for the electronic and promotional services of the Department",
    "people_img_src": "nt_foto.jpg",
    "position_id": "6"
},
{
    "people_id": "74",
    "people_name": "Μαρία Σαβιολάκη",
    "people_name_en": "Maria Saviolaki",
    "people_email": "saviolaki@csd.uoc.gr",
    "people_ext_url": "",
    "people_text": "Διοικητική και Οικονομική υποστήριξη του Τμήματος",
    "people_text_en": "",
    "people_img_src": "MSPhoto1.jpg",
    "position_id": "6"
},
{
    "people_id": "76",
    "people_name": "Βασίλης Ευθυμίου",
    "people_name_en": "Vassilis Efthymiou",
    "people_email": "vefthym@ics.forth.gr",
    "people_ext_url": "https:\/\/sites.google.com\/site\/vefthym\/",
    "people_text": "<span style=\"color:rgba(0,0,0,0.87)\">Πήρε το διδακτορικό του το 2017 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν την αναπαράσταση και επεξεργασία γνώσης, τις Βάσεις Δεδομένων, το Σημασιολογικό Ιστό, την Τεχνητή Νοημοσύνη, και την ανάλυση δεδομένων μεγάλου όγκου.<\/span>",
    "people_text_en": "<span style=\"color:rgba(0,0,0,0.87)\"><font color=\"rgba(0, 0, 0, 0.870588235294118)\" face=\"Roboto Slab, Times New Roman, serif\"><span style=\"font-size:14px;font-variant-ligatures:none;white-space:pre-wrap;background-color:rgb(250,250,250)\"><span style=\"color:rgb(33,44,56);font-family:Roboto,tahoma,sans-serif;font-variant-ligatures:normal;text-align:justify;white-space:normal;background-color:rgb(255,255,255);text-decoration-style:initial;text-decoration-color:initial;float:none;display:inline\">He received his PhD in 2017 from the Computer Science Department of University of Crete. His research interests include<span> knowledge representation and management, Databases, Semantic Web, Artificial Intelligence, and Big Data. <\/span><\/span><\/span><\/font><\/span>",
    "people_img_src": "efthymiou.jpg",
    "position_id": "4"
}
]